{
  "data": [
    {
      "id": 886730924,
      "lang": "en",
      "location_id": 152887,
      "published_date": "2023-04-18T08:04:49Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g150807-d152887-r886730924-Reviews-Hyatt_Ziva_Cancun-Cancun_Yucatan_Peninsula.html?m=66827#review886730924",
      "text": "Yet another incredible experience at Hyatt Ziva Cancun! My husband and I enjoyed our second couples only trip at the Turquoize Tower and everything was amazing! We had our personal butlers, Marie and Fernanda who made sure to make our experience perfection. They helped us make reservations, surprised me with a birthday treat and decorations and were always happy to answer any questions! We had amazing service from Marcelo at El Mercado (he really hooks you up with the best mimosa)! Also, we had great cabana service from July at the beach, and from Irma, Eduardo and Natalia in the Punta Vista tower! I highly recommend the gummy bear shots when you are there! Additionally, the food experience also a big hit this year. Our favorite dining experience was at La Bastille with Cristian, he takes the dining experience to a 20! Another must do for us is the hibachi at moongate, we are not seafood people and the regular menu is pretty seafood heavy, so if you don’t like seafood you’ll need to do the hibachi. This is the only place you need to make a reservation. Antonio was our hibachi chef and he was funny and entertaining the entire time! I never have enough good things to say about this resort, I have been coming here since they opened in 2016(and to dreams before then) and the ONLY downside to this place is how much they try to upsell(the wine, the extra dinners on the beach, the fancier steak cuts etc.) this resort is truly one of the most amazing and the price has become a little too much for us to justify bringing our kids anymore, so the upsells seem to be too much. Though, I do highly recommend paying for the cabanas.",
      "title": "A lovely couples only trip",
      "trip_type": "Couples",
      "travel_date": "2023-04-30",
      "user": {
        "username": "brer_11",
        "user_location": {
          "id": "43656",
          "name": "Woodbury, Minnesota"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/04/02/c2/dc/bre-r.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/04/02/c2/dc/bre-r.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/04/02/c2/dc/bre-r.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-s/04/02/c2/dc/bre-r.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/04/02/c2/dc/bre-r.jpg"
        }
      },
      "subratings": {}
    },
    {
      "id": 886677552,
      "lang": "en",
      "location_id": 152887,
      "published_date": "2023-04-17T20:14:08Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g150807-d152887-r886677552-Reviews-Hyatt_Ziva_Cancun-Cancun_Yucatan_Peninsula.html?m=66827#review886677552",
      "text": "Just got back to CA after an incredible 8th stay at the Ziva Turqouize Tower celebrating a birthday and anniversary (April 8-16). If you’re on the fence about booking, just do it, it is so worth it! \n\nWe specifically requested our cabanas a month in advance and after our last stay, requested Rubelsi to be our butler by name, he’s so incredible. \n\nTo sum it up, the service is incredible as always! All the staff from the bellmen, waiters, bartenders to the butlers make you feel so at home and comfortable. They went above and beyond decorating ther room everyday for us and giving great service from the heart. \n\nOverall, top hits were visiting Punta Vista (Irma and her delicious drinks of course), we love the pool, the exclusivity of the adults only and TT guests and all the staff! The bubble party and Ziva crew were incredible and we had so much fun!!\n\nCabanas are well worth it in my opinion (great facials, aloe sprays and a break from the sun). The pier experience was also great, definitely a to do for bigger parties or families. I hope they further expand with more and maybe place some hammocks down below the deck. \n\nLaundry service was incredibly convenient and a great price ($8 a kg). \n\nFood was really great at the grill by the pool and all the restaurants with the exception of 1 steak at tradewinds, I was not impressed with the wagyu this time around, it was very oily and fatty (not marbled). \nLa Bastille on the other hand blew us away, food and drinks were out of this world along with the service! \nCoffee shop, sweet shop and churro stands are a must go to! \n\nWe were super excited to attend the speakeasy. We were escorted through to the secret location, had to find the entrance and once we got in was a great location but had little sitting areas and the tables that were available you had to buy a bottle of tequila to sit there, within 20 minutes we decided to leave. Really was just not as fun as we expected. \n\nA very special shout out and huge thank you to Irma, Edgar and Eduardo at Punta Vista for serving the best drinks and making sure we had so much fun! \nAngel and Orlando at security at Punta Vista for being so attentive, making sure we always had fresh towels and being so kind! \nAlejandro, Erick, Ana with the Cabana staff for making sure we were taken care of and decorating for our celebrations! \nand lastly our incredible butler Rubelsi and Anna in the Turqouize Tower! Truly made us feel at home and went above and beyond everyday.",
      "title": "An incredible experience",
      "trip_type": "Couples",
      "travel_date": "2023-04-30",
      "user": {
        "username": "darellano18",
        "user_location": {
          "id": "32210",
          "name": "Chula Vista, California"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ec/3d/default-avatar-2020-1.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ec/3d/default-avatar-2020-1.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ec/3d/default-avatar-2020-1.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ec/3d/default-avatar-2020-1.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ec/3d/default-avatar-2020-1.jpg"
        }
      },
      "subratings": {}
    },
    {
      "id": 886675537,
      "lang": "en",
      "location_id": 152887,
      "published_date": "2023-04-17T19:31:45Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g150807-d152887-r886675537-Reviews-Hyatt_Ziva_Cancun-Cancun_Yucatan_Peninsula.html?m=66827#review886675537",
      "text": "We had the best family vacation at Hyatt Ziva. My boys are 13 and 14 and it was perfect. The beach was beautiful and we went in the ocean each day. The pools were amazing and the variety of food was great. The staff treats their guests like royalty and we didn't want for anything. The boys swam with the dolphins, went kayaking, played pool and we all had never ending fun. I am a big fan and we will be returning. ",
      "title": "Spring Break Family Vacation",
      "trip_type": "NONE",
      "travel_date": "2023-04-30",
      "user": {
        "username": "kala0213",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e4/ca/default-avatar-2020-51.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e4/ca/default-avatar-2020-51.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e4/ca/default-avatar-2020-51.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e4/ca/default-avatar-2020-51.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e4/ca/default-avatar-2020-51.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Sleep Quality"
        }
      }
    },
    {
      "id": 886668506,
      "lang": "en",
      "location_id": 152887,
      "published_date": "2023-04-17T17:46:52Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g150807-d152887-r886668506-Reviews-Hyatt_Ziva_Cancun-Cancun_Yucatan_Peninsula.html?m=66827#review886668506",
      "text": "Last minute trip for me and my wife, we both work very stressful jobs and needed a getaway.  Started looking in Florida but ended up deciding on Cancun.  The Hyatt Ziva was a wonderful surprise.  It is an all-inclusive resort.  The service and food was excellent.  Best I have ever had at an all-inclusive resort.  Highly recommend to all.  Great vibe at the pool.  Lots of activities for both adults and children.  ",
      "title": "Amazing location and wonderful resort",
      "trip_type": "NONE",
      "travel_date": "2023-04-30",
      "user": {
        "username": "Thomasblack2275",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f3/e4/default-avatar-2020-30.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f3/e4/default-avatar-2020-30.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f3/e4/default-avatar-2020-30.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f3/e4/default-avatar-2020-30.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f3/e4/default-avatar-2020-30.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Sleep Quality"
        }
      }
    },
    {
      "id": 886653726,
      "lang": "en",
      "location_id": 152887,
      "published_date": "2023-04-17T15:41:04Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g150807-d152887-r886653726-Reviews-Hyatt_Ziva_Cancun-Cancun_Yucatan_Peninsula.html?m=66827#review886653726",
      "text": "We just completed our seven-night vacation at the Hyatt Ziva Cancun and loved it! We have travelled to the Hyatt Zivas in Punta/Cap Cana, Los Cabos, and Puerto Vallarta prior to this trip. Though similar, all these properties are quite different. What stands out the most to me about the Cancun location is the staff. Everyone has been over the top friendly and accommodating. The property itself seems to be an older property that Hyatt has/is renovating. It is beautiful but does have some areas that feel a bit dated. We found the food to be delicious and the bars are phenomenal. Every drink we had was with either Grey Goose or Don Julio. We also jumped at the opportunity to take Pilates, yoga, and the Aqua Fitness classes (SUP yoga in the pool). These classes were awesome and hard! The wellness/fitness staff are talented, fun, and motivating. Here are a few details…\n\nFitness/Wellness- if you are interested in yoga, Pilates, or Aqua Fitness classes, you need to sign up for them in the gym upon arrival. We signed up with Patricia on day one. Our instructors were Arturo, Carlos & Jorge. They are all WONDERFUL. AND they gifted me a present for going to their classes…I felt so special.  Pilates- I believe they have seven reformers. Classes are legit and much harder than I anticipated. Aqua Strong- this is a stand-up paddle board class in the main pool. I would guess they had about 8-10 boards (secured by ropes to the edge of the pool). You are on display for the world to see, but it is REALLY fun and harder than anticipated. I loved the wellness team! \n\nSpa- I had a 50-minute-deep tissue massage (with scalp treatment) from Dina and it was amazing. Dina was one of the best massage therapists I have ever experienced, and I’ve done a lot of massages! She used deep pressure and focused on my neck and upper back. The stretching part of the treatment was wonderful as well. I also enjoyed the complimentary hydrotherapy experience. \n\nRooms- our room in the Club tower was nice and convenient. The set up felt a bit dated, but it was comfortable, quiet and had beautiful views. \n\nFood- we loved the food…\nCoffee House- awesome! I had a nonfat latte every morning and a caramel macchiato every afternoon. \nCandy Store- our kids LOVED this place.\nMoongate- delicious! We had everything from sushi (legit) to noodle dishes to hibachi. We loved this restaurant. \nBastille- we enjoyed dinner here one night with another couple friends of ours. Top items were the French onion soup, starter salad, pea risotto and the fillet. We did order a $60 bottle of red wine (blend) and it was wonderful.\nChevy’s Diner- again, great. We had the fried chicken sandwich, burger, pear salad and chickpea and carrot burger and everything was great.  \nBreakfast Buffet- our family agrees that this was just the BEST. There was so much to choose from AND it was very well done. This was such a treat. \nLobby Bar- High-quality cocktails\nSmoothie bar- enjoyed the green drink and the peanut butter banana smoothies.\nPool grill- there is a pop-up daily grill outside the main pool, and it is great. We had ribs, chicken, burgers, hot dogs, and chorizo during our stay. The cooks are friendly and accommodating as well. \n\nCabanas & Pool Seats:\nThe first half of our trip, we did not have cabanas. The last three days we did. We had one at the Sahara pool, the north beach, and the north pool. We felt it was a great investment. The service was great, and we used them ALL day from 9am to 6pm. The days we did not have cabanas, I put down towels and personal items by the pool on my way to morning Pilates. There were a lot of seats already reserved by then! A good tip is to know that they set up a DJ booth near the hot tub in the afternoon. So, if you are looking for quiet seats, I wouldn’t pick ones near the hot tub. Our favorite pool waiter was Omar. He was amazing!\n\nI would DEFINITELY return to this property. It really has it all. Some of the other Zivas have more modern accommodations, as well as, better beaches, but this resort checks all the boxes for a solid family vacation. Hyatt Ziva Cancun has (hands down) the friendliest staff/team members across the board. Cheers to a wonderful vacation!\n\n",
      "title": "Family w/  Teens/Tweens Spring Break 2023",
      "trip_type": "NONE",
      "travel_date": "2023-04-30",
      "user": {
        "username": "marjonf2018",
        "user_location": {
          "id": "51766",
          "name": "Bend, Central Oregon, Oregon"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f2/7a/default-avatar-2020-25.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f2/7a/default-avatar-2020-25.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f2/7a/default-avatar-2020-25.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f2/7a/default-avatar-2020-25.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f2/7a/default-avatar-2020-25.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      }
    }
  ]
}